import random

Num = random.randint(1 , 100)

print("โปรแกรมทายเลขครับ สู้เขาลูกพวกลิง")
print("----------------------------------------------------------------------")
P_Num = 0
while P_Num != Num:
    P_Num = int(input("ตัวเลข :"))
    
    if Num < P_Num:
        print("เลขมากไปจร้าฟ พวกลิง")
        
    elif Num == P_Num:
        print("ถูกต้องค้าบเบ้บบบ เก่งมากกกก")
        
    else:
        print("เลขน้อยไปจ้าาา พวกลิง")
print("----------------------------------------------------------------------")

print("เก่งมากค้าบแบบเบ้บ")
